app/Http/Controllers/homecontroller.php

    public function index(){

        $membership = MembershipPlan::all();
        $blogs = BlogPost::latest()->get();
        $galleryImages = Gallery::all(); // Fetch all gallery images from the database
---
select * from `blog_posts` order by `created_at` desc
select * from `galleries`