app/Filament/Resources/UserResource.php

select * from `membership_plans`
---
    public static function form(Form $form): Form
    {
        return $form
            ->schema([
                    Forms\Components\TextInput::make('name')->required(),
                    Forms\Components\TextInput::make('email')->required()->email(),
                TextInput::make('password')
                    ->password()
                    ->label('Password')
                    ->required(fn($livewire) => $livewire instanceof Pages\CreateUser) // Required only on create
                    ->dehydrateStateUsing(fn($state) => $state ? bcrypt($state) : null) // Hash only if password is entered
                    ->nullable()
                    ->dehydrated(fn($state) => filled($state)) // Only save if field is filled
                    ->label('New Password'),
                    Forms\Components\Select::make('membership_id')
                    ->label('Membership Plan')
                    ->options(MembershipPlan::all()->pluck('name', 'id'))
                    ->reactive()
                    ->required(),
                Forms\Components\DatePicker::make('membership_start_date')
                    ->label('Start Date')
                    ->default(now()->format('Y-m-d'))
                    ->required()
                    ->reactive()
                    ->afterStateUpdated(function ($state, callable $get, callable $set) {
                        $plan = MembershipPlan::find($get('membership_id')); // Get the selected membership plan
                        if ($plan) {
                            $duration = $plan->duration; // Fetch the plan's duration
                            $endDate = Carbon::parse($state)->addDays($duration); // Calculate the end date
                            $set('membership_end_date', $endDate->toDateString()); // Set the end date field
                        }
                    }),